package com.telegrambotanimalshelter.utils;

import com.pengrad.telegrambot.model.CallbackQuery;
import com.telegrambotanimalshelter.listener.parts.IntroductionPart;
import com.telegrambotanimalshelter.listener.parts.BecomingPetOwnerPart;
import com.telegrambotanimalshelter.listener.parts.MessageSender;
import com.telegrambotanimalshelter.models.Shelter;

public class Constants {

    public static void sendMessage(MessageSender messageSender,Long chatId, String msg){
        messageSender.sendMessage(chatId, msg);
    }

    public static void callBackQueryConstantCheck(CallbackQuery callbackQuery, Shelter shelter,
                                                  IntroductionPart introductionPart,
                                                  BecomingPetOwnerPart becomingPetOwnerPart){
        String shelterName = shelter.getName();
        String data = callbackQuery.data();
        Long id = callbackQuery.from().id();
        if ((shelterName + "_shelter_info").equals(data)) introductionPart.welcome(id, shelter);
        if ((shelterName + "_info").equals(data)) introductionPart.shelterInfo(id, shelter);
        if ((shelterName + "_hours").equals(data)) introductionPart.shelterWorkingHours(id, shelter);
        if ((shelterName + "_pass").equals(data)) introductionPart.shelterPass(id, shelter);
        if ((shelterName + "_safety").equals(data)) introductionPart.shelterSafety(id, shelter);
        if ((shelterName + "_shelter_consultation").equals(data)) becomingPetOwnerPart.part2(id, shelter);
        if ((shelterName + "_acquaintance").equals(data)) becomingPetOwnerPart.acquaintanceWithPet(id, shelter);
        if ((shelterName + "_documents").equals(data)) becomingPetOwnerPart.documentsForPetOwner(id, shelter);
        if ((shelterName + "_transportation").equals(data)) becomingPetOwnerPart.transportation(id, shelter);
        if ((shelterName + "_little").equals(data)) becomingPetOwnerPart.homeForLittlePet(id, shelter);
        if ((shelterName + "_adult").equals(data)) becomingPetOwnerPart.homeForAdultPet(id, shelter);
        if ((shelterName + "_restricted").equals(data)) becomingPetOwnerPart.homeForRestrictedPet(id, shelter);
        if ((shelterName + "_reasons_for_refusal").equals(data)) becomingPetOwnerPart.reasonsForRefusal(id, shelter);
    }

    public static String DOG_SHELTER_DESCRIPTION = """
            Приют работает с 2019 года. В приоритете — спасение сбитых машинами и больных животных.\s
            За период своей деятельности волонтеры спасли более 80 собак, но удалось пристроить только четверых.
             Остальные ждут свой дом, где они будут считаться членами семьи.\s
            Все собаки в приюте имеют паспорта, привиты и кастрированы. В социальных сетях приют старается повышать
             осведомленность людей о важности вакцинации, стерилизации, гуманного отношения к животным.\s
            Приют старается повысить осведомленность людей о важности содержания собак в вольерах,
             так как на цепи собака становится дикой, раздражительной, недоверчивой,
             подавленной и агрессивной по отношению к хозяину.""";

    public static String DOG_SHELTER_WORKING_HOURS = "Мы работаем круглосуточно и без выходных. Найти нас можно по адресу: город Астана, Улица Жұмекен Нәжімеденов, 4, КВ 1803";

    public static String DOG_SHELTER_SAFETY = """
            1. Никогда не подходите к собаке, если она не приблизилась к вам сами. Некоторые собаки могут быть очень застенчивыми и бояться незнакомых людей.
                        
            2. Не позволяйте детям бегать и кричать вокруг собак. Это может испугать их и вызвать агрессивное поведение.
                        
            3. Не пытайтесь кормить собак своей едой. У них есть свой рацион, который необходимо соблюдать.
                        
            4. Никогда не таскайте собак за хвост или уши. Это может вызвать болезненные ощущения и даже привести к травмам.
                        
            5. Не пытайтесь разделить собак, если они начали драться. Это может привести к травмам как для вас, так и для собак.
                        
            6. Если вы заметили, что собака выглядит больной или поврежденной, сообщите об этом персоналу приюта.
                        
            7. Не принимайте решение о приобретении собаки на основе ее внешнего вида. Поговорите с персоналом приюта, чтобы узнать больше о характере и потребностях животного.
                        
            8. Следуйте правилам приюта и не нарушайте их. Это поможет обеспечить безопасность всех посетителей и животных.
            """;

    public static String DOG_SHELTER_SECURITY_CONTACTS = """
            Контактные номера для предварительного оформления пропуска: 43545234657
            """;

    public static String DOG_TRANSPORTATION = """
                    1. Выбор транспортного средства: для транспортировки собаки можно использовать автомобиль, авиатранспорт, поезд или автобус. Необходимо выбрать транспортное средство, которое обеспечит комфортный и безопасный перевоз животного.
                    
                    2. Размер переноски: если собака будет перевозиться в переноске, необходимо выбрать размер, который будет соответствовать размеру животного и обеспечит ему достаточно места для комфортного перемещения.
                    
                    3. Привыкание к переноске: если собака не привыкла к переноске, необходимо провести несколько тренировок, чтобы она чувствовала себя комфортно внутри нее.
                    
                    4. Подготовка перед поездкой: перед поездкой необходимо убедиться, что животное имеет все необходимые прививки и документы, а также обеспечить ему доступ к воде и пище.
                    
                    5. Безопасность: во время транспортировки необходимо обеспечить безопасность животного. Например, во время поездки на автомобиле собаку можно пристегнуть специальным ремнем безопасности или поместить в переноску, которая будет закреплена на заднем сиденье.
                    
                    6. Комфорт: во время транспортировки необходимо обеспечить комфорт животному. Например, можно положить в переноску мягкий плед или игрушку, которая поможет ему расслабиться.
                    
                    Важно помнить, что каждая собака индивидуальна и может иметь свои особенности, поэтому необходимо учитывать их при транспортировке.    
            """;

    public static String HOME_FOR_PUPPY = """
            1. Создайте безопасное пространство: Убедитесь, что дом безопасен для щенка. Уберите все опасные предметы, провода и кабели, которые могут привести к травмам или порче имущества.
                                    
            2. Разместите место для отдыха: Щенку нужно место, где он может отдохнуть и спать. Разместите мягкую кровать или подушку в безопасном месте.
                                    
            3. Установите миски для еды и воды: Разместите миски для еды и воды в удобном месте, где щенок может легко добраться до них.
                                    
            4. Создайте место для игры: Щенок нуждается в месте, где он может играть и развиваться. Разместите игрушки в безопасном месте, где щенок может играть без препятствий.
                                    
            5. Обучите щенка: Обучите щенка правилам поведения в доме. Начните с простых команд, таких как "Сидеть" и "Оставаться". Обучение поможет щенку адаптироваться к новому дому и стать хорошим компаньоном.
                                    
            6. Проведите время с щенком: Щенок нуждается во внимании и любви. Проводите время с ним, играйте, тренируйте и обучайте его. Это поможет укрепить связь между вами и вашим новым другом.
                                    
            7. Обеспечьте регулярный уход: Щенок нуждается в регулярном уходе, включая купание, расчесывание шерсти и регулярную гигиену. Обеспечьте ему здоровое питание и регулярные посещения ветеринара.""";


    public static String HOME_FOR_ADULT_DOG = """
            Обустройство дома для взрослой собаки может быть легким и приятным процессом, если учесть несколько простых рекомендаций:

            1. Предоставьте собаке свое пространство. Собаки любят иметь свое место, где они могут спокойно отдыхать и спать. Предоставьте своей собаке место, где она может отдыхать, и убедитесь, что это место находится в тихом месте дома.

            2. Обеспечьте собаке место для игры. Собаки любят играть, особенно на свежем воздухе. Обеспечьте своей собаке игрушки и место для игры, и убедитесь, что это место безопасно для нее.

            3. Обеспечьте собаке место для занятий. Собаки любят занятия, которые помогают им развиваться и сохранять здоровье. Предоставьте своей собаке место для занятий, где она может заниматься физическими упражнениями или играть со специальными игрушками.

            4. Обеспечьте безопасность. Обеспечьте безопасность собаки, убрав из дома все опасные предметы и обеспечив надежную защиту от других животных.

            5. Обеспечьте место для туалета. Предоставьте своей собаке место для туалета, которое будет удобным для нее и легко доступным.

            6. Обеспечьте место для кормления. Предоставьте своей собаке место для кормления, где она может получать еду и воду.

            7. Обеспечьте собаке место для отдыха на свежем воздухе. Собаки любят проводить время на свежем воздухе, поэтому обеспечьте своей собаке место для отдыха на свежем воздухе, где она может наслаждаться природой.

            8. Разработайте план тренировок. Собаки нуждаются в регулярных тренировках, чтобы сохранять свое здоровье и физическую форму. Разработайте план тренировок для своей собаки, который будет соответствовать ее возрасту, здоровью и физическим возможностям.

            В целом, обустройство дома для взрослой собаки не требует больших затрат и может быть легко выполнено с помощью простых рекомендаций. Помните, что ваша собака нуждается в комфорте и безопасности, поэтому обеспечьте ей лучшие условия жизни в вашем доме.""";

    public static String HOME_FOR_RESTRICTED_DOG = """
            Для обустройства дома для собаки-инвалида необходимо учесть несколько важных моментов:

            1. Создать безбарьерную среду. Обеспечьте доступ к входу в дом или во двор без лестниц, порогов и других препятствий, которые могут затруднять передвижение собаки.

            2. Обеспечить удобное место для отдыха. Собаке нужно место, где она может отдыхать и спать. Выберите место, которое будет удобным для нее и обеспечьте мягкую поверхность для сна.

            3. Разработать план движения. Если у собаки есть проблемы с передвижением, то необходимо разработать план движения по дому. Обеспечьте ей доступ к местам, где она может получить еду и воду, а также к месту для сна.

            4. Установить специальные приспособления. Для собаки-инвалида могут понадобиться специальные приспособления, такие как подъемник или инвалидная коляска. Разговаривайте с ветеринаром и специалистами по оборудованию для животных, чтобы определить, какие приспособления будут необходимы.

            5. Обеспечить безопасность. Обеспечьте безопасность собаки, убрав из дома все опасные предметы и обеспечив надежную защиту от других животных.

            6. Обеспечить занятия и развлечения. Собаке нужно занятие и развлечения, даже если она не может передвигаться. Разработайте игры и занятия, которые будут интересны ей и помогут ей развиваться.

            В целом, обустройство дома для собаки-инвалида может быть сложным процессом, но с помощью ветеринара и специалистов по оборудованию для животных вы сможете создать безопасное и комфортное место для вашего питомца.
            """;

    public static String FIRST_MEETING_WITH_DOG = """
            Первая встреча с собакой из приюта может быть волнительной как для вас, так и для животного. Вот несколько советов кинолога, которые помогут сделать этот процесс более комфортным и безопасным:
                        
            1. Подойдите к собаке медленно и осторожно. Никогда не приближайтесь к ней слишком быстро или неожиданно.
                        
            2. Не пытайтесь гладить или обнимать собаку, пока она не познакомится с вами. Позвольте ей самой подойти к вам и понюхать вас.
                        
            3. Говорите с собакой мягким и спокойным голосом. Избегайте громких звуков и резких движений.
                        
            4. Не показывайте страх или нервозность перед собакой. Это может вызвать у нее беспокойство и агрессивное поведение.
                        
            5. Позвольте собаке немного времени, чтобы осмотреть вас и познакомиться с вами. Не пытайтесь заставить ее делать что-то, что она не хочет.
                        
            6. Если собака начинает лаять или проявлять агрессивное поведение, не приближайтесь к ней. Обратитесь за помощью к персоналу приюта.
                        
            7. Если у вас есть домашние животные, приводите их на первую встречу с собакой только после того, как вы убедитесь в ее безопасности.
                        
            8. Следуйте инструкциям персонала приюта и не нарушайте правила по обращению с животными. Это поможет обеспечить безопасность вас и собаки.
            """;

    public static String CAT_SHELTER_SECURITY_CONTACTS = """
            Контактные номера для предварительного оформления пропуска: 8 705 763 87 76
            """;
    public static String CAT_SHELTER_DESCRIPTION = """
            В столице появился настоящий «кошкин дом», где живут около 60 пушистых питомцев.
             Все обитатели приюта с трудной судьбой: одних нашли на улице, других подобрали в подвале,
             есть и те, от которых отказались хозяева. Здесь за представителями семейства кошачьих не только
             ухаживают и кормят, но и лечат, ставят прививки, а также подыскивают им новых хозяев.
             Всего за один месяц работы приюта свой новый дом нашли 20 животных.""";

    public static String CAT_SHELTER_SAFETY = """
            1. Никогда не подходите к кошкам, если они не приблизились к вам сами. Некоторые кошки могут быть очень застенчивыми и бояться незнакомых людей.
                        
            2. Не позволяйте детям бегать и кричать вокруг кошек. Это может испугать их и вызвать агрессивное поведение.
                        
            3. Не пытайтесь кормить кошек своей едой. У них есть свой рацион, который необходимо соблюдать.
                        
            4. Никогда не таскайте кошек за хвост или уши. Это может вызвать болезненные ощущения и даже привести к травмам.
                        
            5. Не пытайтесь разделить кошек, если они начали драться. Это может привести к травмам как для вас, так и для кошек.
                        
            6. Если вы заметили, что кошка выглядит больной или поврежденной, сообщите об этом персоналу приюта.
                        
            7. Не принимайте решение о приобретении кошки на основе ее внешнего вида. Поговорите с персоналом приюта, чтобы узнать больше о характере и потребностях животного.
                        
            8. Следуйте правилам приюта и не нарушайте их. Это поможет обеспечить безопасность всех посетителей и животных.
            """;
    public static String CAT_SHELTER_WORKING_HOURS = "Мы работаем Вт-Вс: с 13.00 до 20.00ч, понедельник выходной. Найти нас можно по адресу: Г.АСТАНА, РАЙОН САРЫАРКА, улица Степан Разин, дом 15";


    public static String CAT_TRANSPORTATION = "При транспортировке кошки желательно иметь подходящую по размеру переноску " +
            "с жесткими стенками и мягкой подстилкой внутри. Перевозить кошку на руках или без " +
            "переноски крайне не рекомендуется, поскольку она может помешать водителю вплоть до создания аварийной ситуации. " +
            "К тому же, большинство кошек в закрытой переноске чувствуют себя гораздо спокойнее.\n" +
            "Если кошка обладает крайне беспокойным или пугливым характером, " +
            "то накануне поездки можно начать использование успокоительных препаратов растительного происхождения." +
            "Для кошек, имеющих чувствительный вестибулярный аппарат " +
            ", также существует ряд эффективных средств " +
            "от укачивания животных в транспорте. Эти и другие препараты, а также предметы по уходу за животными " +
            "(переноски, намордники, ошейники, одежда, игрушки, корма для животных и прочее) можно приобрести" +
            " в нашей любой ветеринарной аптеке.";

    public static String HOME_FOR_KITTY = """
            Подготовка к появлению котенка
            Переезд в новый дом — настоящий переворот в жизни котенка. Чтобы помочь ему освоиться и чувствовать себя в безопасности в новой обстановке, очень важно подготовиться к его появлению.
            Как подготовить дом к появлению котенка
            Перед тем как забрать котенка домой, убедитесь, что все готово к его появлению. Кроме приобретения всего необходимого вам следует также подготовить свой дом и членов семьи. Примите во внимание следующие рекомендации:
            Пошаговые инструкции по созданию безопасных условий для содержания котенка в доме
            Котята любят лазать, исследовать окружающую обстановку и прятаться. Поэтому крайне важно позаботиться о безопасности питомца и заранее подготовить дом к его появлению. Мы составили контрольный список, чтобы помочь вам в этом.
            1.Ядовитые комнатные растения
            Некоторые комнатные растения (например, лилии) могут быть токсичными для кошек. Попросите у ветеринарного врача полный список таких растений. Лучше убрать их из дома до прибытия котенка.
            2.Унитазы и мусорные баки
            Закрывайте унитазы и мусорные баки, чтобы котенок не упал в них. Помимо этого, прячьте от котенка ленты мешков для мусора, чтобы питомец не запутался в них или не проглотил.
            3.Опасные вещества
            Убедитесь, что лекарства, чистящие средства и другие токсичные вещества хранятся в безопасном месте. Некоторые средства от блох для собак опасны для кошек, а антифриз представляет для них смертельную угрозу.
            4.Укромные места
            Котята любят прятаться в таких местах, как корзины для белья, сушильные машины и пространства под мебелью. Определите места, где ваш котенок может спрятаться, и либо заблокируйте их, либо следите за тем, чтобы котенок не оказался в ловушке.
            5.Электрические кабели и розетки
            Чтобы предотвратить разгрызание котенком кабелей или его запутывание в проводах, спрячьте их с помощью специальных коробов или стяжек. Не забудьте также закрыть розетки крышками.
            6.Ядовитые продукты
            Некоторые из полезных или вкусных для людей продуктов могут быть ядовитыми для кошек или вызывать у них проблемы с пищеварением. К таким продуктам относятся лук, чеснок, сырые яйца, сырое мясо, шоколад, коровье молоко, виноград и изюм. Поэтому храните свою еду вне досягаемости котенка и предупредите членов семьи, что ему можно давать только специальный корм.
            7.Мелкие предметы
            Спрячьте мелкие предметы, такие как пуговицы и детские игрушки, которые котенок может проглотить. Кроме того, не оставляйте на виду пластиковые пакеты и пенопластовые предметы, так как котенок может разгрызть их и подавиться.
            Создание безопасных условий для котенка в саду
            В первое время котенок не будет выходить на улицу, однако вы должны убедиться, что ваш сад безопасен и подготовлен к его появлению. Вот важные моменты, о которых следует позаботиться:
            1.Ограждения и ворота
            Ваш котенок скоро научится перелезать через заборы и ворота. Но даже если ваш сад полностью огорожен, стоит убедиться в отсутствии отверстий, в которые котенок может пролезть, пока он маленький.
            2.Ядовитые садовые растения
            Как и комнатные растения, многие уличные растения ядовиты для кошек. Даже если кошка избегает их, она может слизывать пыльцу, случайную попавшую на шерсть. Чтобы обезопасить питомца, попросите у ветеринарного врача список ядовитых растений в вашем регионе и устраните опасные.
            3.Возможные опасности
            Осмотрите свой сад, чтобы убедиться, что в нем не осталось опасных для котенка предметов и мест, где он может пораниться или застрять.
            4.Пруды и водоемы
            Безопаснее всего закрывать пруды и водоемы с крутыми берегами, чтобы котенок не мог упасть в них и утонуть, и чтобы он не пил из них.
            5.Инструменты и мелкие предметы
            Убедитесь, что в вашем саду нет мелких предметов, которые ваш котенок может проглотить или подавиться ими. Также спрячьте острые садовые инструменты.
            6.Опасные вещества
            Храните все садовые химикаты, такие как удобрения, инсектициды, краски и растворители, в безопасном и закрытом месте.""";

    public static String HOME_FOR_ADULT_CAT = """
            Обустройство дома для взрослой кошки может быть легким и приятным процессом, если учесть несколько простых рекомендаций:
                                    
            1. Предоставьте кошке свое пространство. Кошки любят иметь свое место, где они могут спокойно отдыхать и спать. Предоставьте своей кошке место, где она может отдыхать, и убедитесь, что это место находится в тихом месте дома.
                                    
            2. Обеспечьте кошке место для игры. Кошки любят играть, особенно на свежем воздухе. Обеспечьте своей кошке игрушки и место для игры, и убедитесь, что это место безопасно для нее.
                                    
            3. Обеспечьте кошке место для занятий. Кошки любят занятия, которые помогают им развиваться и сохранять здоровье. Предоставьте своей кошке место для занятий, где она может заниматься физическими упражнениями или играть со специальными игрушками.
                                    
            4. Обеспечьте безопасность. Обеспечьте безопасность кошки, убрав из дома все опасные предметы и обеспечив надежную защиту от других животных.
                                    
            5. Обеспечьте место для туалета. Предоставьте своей кошке место для туалета, которое будет удобным для нее и легко доступным.
                                    
            6. Обеспечьте место для кормления. Предоставьте своей кошке место для кормления, где она может получать еду и воду.
                                    
            В целом, обустройство дома для взрослой кошки не требует больших затрат и может быть легко выполнено с помощью простых рекомендаций. Помните, что ваша кошка нуждается в комфорте и безопасности, поэтому обеспечьте ей лучшие условия жизни в вашем доме.""";


    public static String HOME_FOR_RESTRICTED_CAT = """
            Обустроить дом для кошки-инвалида можно с помощью следующих рекомендаций:

            1. Создать безбарьерную среду. Обеспечьте доступ ко всем местам, где кошка может передвигаться, без лестниц, порогов и других препятствий, которые могут затруднять ее передвижение.

            2. Обеспечить удобное место для отдыха. Кошке нужно место, где она может отдыхать и спать. Выберите место, которое будет удобным для нее и обеспечьте мягкую поверхность для сна.

            3. Разработать план движения. Если у кошки есть проблемы с передвижением, то необходимо разработать план движения по дому. Обеспечьте ей доступ к местам, где она может получить еду и воду, а также к месту для сна.

            4. Установить специальные приспособления. Для кошки-инвалида могут понадобиться специальные приспособления, такие как лестницы, рампы, корзины для передвижения и т.д. Разговаривайте с ветеринаром и специалистами по оборудованию для животных, чтобы определить, какие приспособления будут необходимы.

            5. Обеспечить безопасность. Обеспечьте безопасность кошки, убрав из дома все опасные предметы и обеспечив надежную защиту от других животных.

            6. Обеспечить занятия и развлечения. Кошке нужно занятие и развлечения, даже если она не может передвигаться. Разработайте игры и занятия, которые будут интересны ей и помогут ей развиваться.

            В целом, обустройство дома для кошки-инвалида может быть сложным процессом, но с помощью ветеринара и специалистов по оборудованию для животных вы сможете создать безопасное и комфортное место для вашего питомца.""";

    public static String REASONS_FOR_REFUSAL = """
                    Существует несколько причин, по которым приют может отказать в выдаче животного:

                    1. Нарушение правил приюта: если владелец не соблюдал правила приюта (например, не оплачивал услуги или не соблюдал правила ухода за животными), приют может отказать в выдаче животного.

                    2. Несоответствие условиям содержания: если приют считает, что условия содержания у владельца не соответствуют требованиям для конкретного животного (например, если у владельца нет достаточно места или необходимого оборудования для содержания животного), приют может отказать в выдаче животного.

                    3. Проблемы со здоровьем животного: если животное нуждается в лечении или специальном уходе, приют может отказать в выдаче животного, пока эти проблемы не будут решены.

                    4. Несоответствие требованиям: если владелец не соответствует требованиям, установленным приютом (например, если он не является совершеннолетним или не имеет документов, подтверждающих его личность), приют может отказать в выдаче животного.

            В любом случае, приют всегда будет стараться найти лучшее решение для животного и его будущего владельца.
            """;

    public static String CONTRACT_DOCUMENTS = "В нашей организации при передаче животного оформляется договор с будущим хозяином животного. " +
            "В нем фиксируются данные обеих сторон, оговариваются пункты ответственного содержания животного." +
            " Мы также всегда ненавязчиво отслеживаем судьбу наших бывших подопечных." +
            " Всех наших питомцев мы лично провожаем до места их дальнейшего жительства. \n " +
            "Для подписания документов, вам достатоно иметь паспорт гражданина Казахстана.";

    public static String DOG_ACQUAINTANCE = "Если вы хотите с ней познакомиться, присядьте на ее уровень и спокойно попросите ее подойти," +
            " произнеся кличку. Если собака насторожилась или боится, не настаивайте на контакте, " +
            "дождитесь, пока она сама захочет к вам подойти. Дайте собаке возможность вас обнюхать, " +
            "не смотрите ей прямо в глаза.";

    public static String CAT_ACQUAINTANCE = """
            Кошек нужно сближать постепенно, тогда знакомство пройдет более удачно.
             При появлении нового животного нельзя переставать любить уже имеющегося питомца.
             При любой возможности показывайте ему свою любовь, гладьте, балуйте вкусной едой. \n
             Создайте все условия для того, чтобы старый питомец смог принять нового жильца.""";
}
